#+TITLE: September 11-23, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                      | WAITING | DONE | CANCELED |
|------+------+--------------------------------------------------+---------+------+----------|
|      |      | WRITE.1536571387. Learn to use Dvorak keyboard l |         |      |          |
|      |      | READ.1536571485. Learn GNU Emacs                 |         |      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------+------+-----------+--------------+------------|
| Bhavin192     |         0 |      0 |    0 |         0 |   2018-09-17 | ---------- |
| Jasonbraganza |      26.0 |  11.04 |    0 |      26.0 |   2018-10-04 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  40 +---------------------------------------------------------------------+   
:     |         .                                                           |   
:  35 |+         ....                                         IDEAL .......+|   
:     |              .                                                      |   
:  30 |+              ......                                               +|   
:     |                     .....                                           |   
:     |                          ....                                       |   
:  25 |+                             .                                     +|   
:     |                               ......                                |   
:  20 |+                                    ....                           +|   
:     |                                         .                           |   
:  15 |+                                         .....                     +|   
:     |                                               ......                |   
:  10 |+                                                    ....           +|   
:     |                                                         .           |   
:     |                                                          .....      |   
:   5 |+                                                              .    +|   
:     |                                                                .....|   
:   0 +---------------------------------------------------------------------+   
:     0          2          4         6          8          10         12       
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2018-10-11 |        |    39 |                 |
|   2 | 2018-10-12 |        |    36 |                 |
|   3 | 2018-10-13 |        |    32 |                 |
|   4 | 2018-10-14 |        |    29 |                 |
|   5 | 2018-10-15 |        |    26 |                 |
|   6 | 2018-10-16 |        |    23 |                 |
|   7 | 2018-10-17 |        |    20 |                 |
|   8 | 2018-10-18 |        |    16 |                 |
|   9 | 2018-10-19 |        |    13 |                 |
|  10 | 2018-10-20 |        |    10 |                 |
|  11 | 2018-10-21 |        |     6 |                 |
|  12 | 2018-10-22 |        |     3 |                 |
|  13 | 2018-10-23 |        |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                           | TASKID           | OWNER         | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| TASKS                                          |                  |               | B        |             |     42.25 |  11.04 |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learn to use Dvorak keyboard layout            | WRITE.1536571387 | jasonbraganza | B        | IN_PROGRESS |      13.0 |   6.17 |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learn GNU Emacs                                | READ.1536571485  | jasonbraganza | B        | IN_PROGRESS |      13.0 |   4.87 |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 4 Exercises            | DEV.1537165961   | bhavin192     | B        |             |       2.0 |        |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 5. Functions           | READ.1537166028  | bhavin192     | B        |             |      5.25 |        |
|------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 5. Functions Exercises | DEV.1537166050   | bhavin192     | B        |             |         9 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2018-10-11 Tue>
  :wpd-jasonbraganza: 2
  :wpd-bhavin192: 1.25
  :END:
** IN_PROGRESS Learn to use Dvorak keyboard layout [12/14]
   :PROPERTIES:
   :ESTIMATED: 13.0
   :ACTUAL:   7.17
   :OWNER: jasonbraganza
   :ID: WRITE.1536571387
   :TASKID: WRITE.1536571387
   :END:
   :LOGBOOK:
   CLOCK: [2018-09-17 Mon 16:00]--[2018-09-17 Mon 16:30] =>  0:30
   CLOCK: [2018-09-17 Mon 15:30]--[2018-09-17 Mon 16:00] =>  0:30
   CLOCK: [2018-09-16 Sun 11:00]--[2018-09-16 Sun 11:30] =>  0:30
   CLOCK: [2018-09-15 Sat 11:00]--[2018-09-15 Sat 12:00] =>  1:00
   CLOCK: [2018-09-14 Fri 09:30]--[2018-09-14 Fri 10:45] =>  1:15
   CLOCK: [2018-09-13 Thu 16:00]--[2018-09-13 Thu 16:55] =>  0:55
   CLOCK: [2018-09-12 Wed 12:30]--[2018-09-12 Wed 12:50] =>  0:20
   CLOCK: [2018-09-12 Wed 12:00]--[2018-09-12 Wed 12:30] =>  0:30
   CLOCK: [2018-09-12 Wed 10:20]--[2018-09-12 Wed 11:00] =>  0:40
   CLOCK: [2018-09-11 Tue 14:30]--[2018-09-11 Tue 15:00] =>  0:30
   CLOCK: [2018-09-11 Tue 11:00]--[2018-09-11 Tue 11:30] =>  0:30
   :END:
   - [X] 1. The home row
   - [X] 2. Learning the Shift Key
   - [X] 3. Home Row and the Period
   - [X] 4. Upper Row and Essential Punctuation
   - [X] 5. Review
   - [X] 6. Learning the Lower Row
   - [X] 7. Practise
   - [X] 8. Practise
   - [X] 9. Practise
   - [X] 10. Practise
   - [X] 11. Practise
   - [X] 12. Practise
   - [ ] 13. Frequent words
   - [ ] 14. Alphabetic sentences
** IN_PROGRESS Learn GNU Emacs [8/14]
   :PROPERTIES:
   :ESTIMATED: 13.0
   :ACTUAL:   5.87
   :OWNER: jasonbraganza
   :ID: READ.1536571485
   :TASKID: READ.1536571485
   :END:
   :LOGBOOK:
   CLOCK: [2018-09-17 Mon 17:20]--[2018-09-17 Mon 17:45] =>  0:25
   CLOCK: [2018-09-17 Mon 16:45]--[2018-09-17 Mon 17:20] =>  0:35
   CLOCK: [2018-09-15 Sat 12:10]--[2018-09-15 Sat 13:10] =>  1:00
   CLOCK: [2018-09-14 Fri 11:00]--[2018-09-14 Fri 12:00] =>  1:00
   CLOCK: [2018-09-13 Thu 17:00]--[2018-09-13 Thu 17:40] =>  0:40
   CLOCK: [2018-09-12 Wed 15:30]--[2018-09-12 Wed 16:42] =>  1:12
   CLOCK: [2018-09-11 Tue 15:20]--[2018-09-11 Tue 16:00] =>  0:40
   CLOCK: [2018-09-11 Tue 15:00]--[2018-09-11 Tue 15:20] =>  0:20
   :END:
   - [X] 1. Emacs Basics
   - [X] 2. Editing
   - [X] 3. Search and Replace
   - [X] 4. Using Buffers, Windows, and Frames
   - [X] 5. Emacs as a Work Environment
   - [X] 6. Writing Macros
   - [X] 7. Simple Text Formatting and Specialized Editing
   - [X] 8. Markup Language Support
   - [ ] 9. Computer Language Support
   - [ ] 10. Customizing Emacs
   - [ ] 11. Emacs Lisp Programming
   - [ ] 12. Version Control
   - [ ] 13. Platform-specific considerations
   - [ ] 14. The Help System

** Learning Golang Chapter 4 Exercises [0/1]
   :PROPERTIES:
   :ESTIMATED: 2.0
   :ACTUAL:
   :OWNER: bhavin192
   :ID: DEV.1537165961
   :TASKID: DEV.1537165961
   :END:
   - [ ] Exercise 4.13 Part II
** Learning Golang Chapter 5. Functions [0/4]
   :PROPERTIES:
   :ESTIMATED: 5.25
   :ACTUAL:
   :OWNER: bhavin192
   :ID: READ.1537166028
   :TASKID: READ.1537166028
   :END:
   - [ ] 5.1 Function Declarations
   - [ ] 5.2 Recursion
   - [ ] 5.3 Multiple Return Values
   - [ ] 5.4 Errors
** Learning Golang Chapter 5. Functions Exercises [0/5]
   :PROPERTIES:
   :ESTIMATED: 9
   :ACTUAL:
   :OWNER: bhavin192
   :ID: DEV.1537166050
   :TASKID: DEV.1537166050
   :END:
   - [ ] 5.1
   - [ ] 5.2
   - [ ] 5.3
   - [ ] 5.4
